Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/P30A.tmx
Source language: en_us
Languages: zh_cn

source: The Kiss
zh_cn: 吻

source: It was still quite light out of doors, but inside with the curtains drawn and the smouldering fire sending out a dim, uncertain glow, the room was full of deep shadows.
zh_cn: 屋外的天色还很亮，但是里面拉上了窗帘，焖烧的火发出一线暗淡、飘忽不定的光，屋子里全是深暗的阴影。

source: Brantain sat in one of these shadows; it had overtaken him and he did not mind.
zh_cn: 布兰泰恩坐在其中一处阴影里，阴影把他全部笼罩了，而他却毫不在意。

source: The obscurity lent him courage to keep his eyes fastened as ardently as he liked upon the girl who sat in the firelight.
zh_cn: 阴暗给了他勇气，使他随心所欲地将目光热烈地锁定在坐在火光中的女孩身上。

source: She was very handsome, with a certain fine, rich coloring that belongs to the healthy brune type.
zh_cn: 她长得很漂亮，肤色精致润泽，属于健康的深色肤型。

source: She was quite composed, as she idly stroked the satiny coat of the cat that lay curled in her lap, and she occasionally sent a slow glance into the shadow where her companion sat.
zh_cn: 她非常沉静，悠闲地抚摸着蜷曲在她膝上的小猫光滑的皮毛，偶而缓缓地向她同伴所坐的那处阴影瞥上一眼。

source: They were talking low, of indifferent things which plainly were not the things that occupied their thoughts.
zh_cn: 他们在低声谈些无关紧要的小事，那些事显然并不是他们的心思所在。

source: She knew that he loved her- a frank, blustering fellow without guile enough to conceal his feelings, and no desire to do so.
zh_cn: 她知道他爱她——一个率直的、大大咧咧的人没有足够的诡计来隐藏他的感情，他也无意这么做。

source: For two weeks past he had sought her society eagerly and persistently.
zh_cn: 过去的两个星期里，他坚持不懈地、热切地追随她。

source: She was confidently waiting for him to declare himself and she meant to accept him.
zh_cn: 她自信地等着他告白，并且打算接受他。

source: The rather insignificant and unattractive Brantain was enormously rich; and she liked and required the entourage which wealth could give her.
zh_cn: 这个相当不起眼的、毫无魅力的布兰泰恩非常富有；而她喜欢并且也需要财富能够带给她的生活环境。

source: During one of the pauses between their talk of the last tea and the next reception the door opened and a young man entered whom Brantain knew quite well.
zh_cn: 他们谈论着上次的茶会和下次的招待会，在谈话中间的沉默间隙里门开了，一个年轻人进来了，这个人布兰泰恩很熟识。

source: The girl turned her face toward him.
zh_cn: 女孩脸转向他。

source: A stride or two brought him to her side, and bending over her chair- before she could suspect his intention, for she did not realize that he had not seen her visitor- he pressed an ardent, lingering kiss upon her lips.
zh_cn: 他一两步就走到了她身边，俯身在她椅子上方——在她还没来得及觉察他的意图之前，因为她没想到他没有看到她的访客——他将一个热烈、长久的吻印在她唇上。

source: Brantain slowly arose; so did the girl arise, but quickly, and the newcomer stood between them, a little amusement and some defiance struggling with the confusion in his face.
zh_cn: 布兰泰恩慢慢地站起来；女孩也站起来了，动作却是很快的，而那个新来的人站在他们中间，少许玩乐和一些挑衅与他脸上的困惑艰难地交织着。

source: "I believe," stammered Brantain, "I see that I have stayed too long.
zh_cn: “我想，”布兰泰恩结结巴巴地说，“看来我待的时间太长了。

source: I- I had no idea- that is, I must wish you good-by."
zh_cn: 我——我没想到——我是说，我必须和你们说再见了。”

source: He was clutching his hat with both hands, and probably did not perceive that she was extending her hand to him, her presence of mind had not completely deserted her; but she could not have trusted herself to speak.
zh_cn: 他两只手抓着帽子，大概没察觉到她对他伸出了手，她还没完全失去理智；但她相信自己已说不出话了。

source: "Hang me if I saw him sitting there, Nattie!
zh_cn: “要是我看到他坐在那里你就绞死我，纳蒂！

source: I know it's deuced awkward for you.
zh_cn: 我知道对你来说这太尴尬了。

source: But I hope you'll forgive me this once- this very first break.
zh_cn: 但我希望你原谅我这一次——这第一次冒犯。

source: Why, what's the matter?"
zh_cn: 哎，怎么了？”

source: "Don't touch me; don't come near me," she returned angrily. "What do you mean by entering the house without ringing?"
zh_cn: “别碰我；别走近我，”她愤怒地回答道，“你不按门铃就进到房里想要干什么？”

source: "I came in with your brother, as I often do," he answered coldly, in self-justification. "We came in the side way.
zh_cn: “我和你哥哥一起进来的，和平常一样，”他冷冷地答道，为自己辩白，“我们从小路进来的。

source: He went upstairs and I came in here hoping to find you.
zh_cn: 他上了楼，我到这里来希望找到你。

source: The explanation is simple enough and ought to satisfy you that the misadventure was unavoidable.
zh_cn: 这件不幸的事是不可避免的，这解释够简单，应该能让你满意。

source: But do say that you forgive me, Nathalie," he entreated, softening.
zh_cn: 但你一定要原谅我，纳瑟莉，”他恳求道，语气变得温和。

source: "Forgive you!
zh_cn: “原谅你！

source: You don't know what you are talking about.
zh_cn: 你不知道自己在说什么。

source: Let me pass.
zh_cn: 让我过去。

source: It depends upon- a good deal whether I ever forgive you."
zh_cn: 我原不原谅你要看——很多事。”

source: At that next reception which she and Brantain had been talking about she approached the young man with a delicious frankness of manner when she saw him there.
zh_cn: 在她和布兰泰恩所谈论的那个下一次的招待会上，当她看到他在那里时，她以一种十分坦率的样子向这个年轻人走过来。

source: "Will you let me speak to you a moment or two, Mr. Brantain?" she asked with an engaging but perturbed smile.
zh_cn: “可以跟您说几句话吗，布兰泰恩先生？”她面带迷人而不安的微笑问道。

source: He seemed extremely unhappy; but when she took his arm and walked away with him, seeking a retired corner, a ray of hope mingled with the almost comical misery of his expression.
zh_cn: 他看起来极为不快乐；但是当她挽起他的胳膊，和他一起走开寻找一处偏僻的角落时，一线希望混合进他脸上几乎很好笑的痛苦神情里。

source: She was apparently very outspoken.
zh_cn: 显然她非常坦率。

source: "Perhaps I should not have sought this interview, Mr. Brantain; but- but, oh, I have been very uncomfortable, almost miserable since that little encounter the other afternoon.
zh_cn: “或许我不该来和你说的，布兰泰恩先生；但是——但是，哦，自从那天下午的那次小冲突后，我一直很不安，几乎是痛苦不堪。

source: When I thought how you might have misinterpreted it, and believed things"- hope was plainly gaining the ascendancy over misery in Brantain's round, guileless face-
zh_cn: 我一想到你可能会怎么曲解这件事，相信一些事情”——希望在布兰泰恩单纯的圆脸上正清楚地获得压倒痛苦的优势地位——“

source: "Of course, I know it is nothing to you, but for my own sake I do want you to understand that Mr. Harvy is an intimate friend of long standing.
zh_cn: 当然了，我知道对你来说这没什么，但为了我自己的缘故，我真的想要你明白哈维先生是一个认识很长时间的亲密朋友。

source: Why, we have always been like cousins- like brother and sister, I may say.
zh_cn: 嗯，我们一直都像是堂表兄妹——我可以说就像是兄妹。

source: He is my brother's most intimate associate and often fancies that he is entitled to the same privileges as the family.
zh_cn: 他是我哥哥最亲密的合伙人，经常认为他和家人一样享有同样的特权。

source: Oh, I know it is absurd, uncalled for, to tell you this; undignified even," she was almost weeping, "but it makes so much difference to me what you think of- of me."
zh_cn: 哦，我知道告诉你这些很荒谬、很没道理；甚至很不庄重，”她差不多在哭泣了，“但是你对——对我怎么想对我来说有很大的区别。”

source: Her voice had grown very low and agitated.
zh_cn: 她的声音变得很低，而且不安。

source: The misery had all disappeared from Brantain's face.
zh_cn: 痛苦全部从布兰泰恩的脸上消失了。

source: "Then you do really care what I think, Miss Nathalie?
zh_cn: “这么说你真的在乎我是怎么想的，纳瑟莉小姐？

source: May I call you Miss Nathalie?"
zh_cn: 我可以称呼你纳瑟莉小姐吗？”

source: They turned into a long, dim corridor that was lined on either side with tall, graceful plants.
zh_cn: 他们转进一条长而微暗的走廊，两旁是高大优美的植物。

source: They walked slowly to the very end of it.
zh_cn: 他们慢慢地走到走廊尽头。

source: When they turned to retrace their steps Brantain's face was radiant and hers was triumphant.
zh_cn: 当他们转身折回脚步时，布兰泰恩的脸上容光焕发，而她的脸上是胜利的笑容。

source: Harvy was among the guests at the wedding; and he sought her out in a rare moment when she stood alone.
zh_cn: 婚礼上哈维在客人之列；在她单独站着的稀有时刻里他找到她。

source: "Your husband," he said, smiling, "has sent me over to kiss you."
zh_cn: “你丈夫，”他微笑着说，“叫我过来吻你。”

source: A quick blush suffused her face and round polished throat.
zh_cn: 一抹绯红飞快地漫上她的脸和圆而光洁的脖颈。

source: "I suppose it's natural for a man to feel and act generously on an occasion of this kind.
zh_cn: “我想一个男人在这样的场合感觉和行动都大方是很正常的。

source: He tells me he doesn't want his marriage to interrupt wholly that pleasant intimacy which has existed between you and me.
zh_cn: 他告诉我他不希望他的婚姻完全妨碍你和我之间存在的那种愉快的亲密关系。

source: I don't know what you've been telling him," with an insolent smile, "but he has sent me here to kiss you."
zh_cn: 我不知道你跟他说了什么，”面带一丝傲慢的微笑，“但他叫我过来吻你。”

source: She felt like a chess player who, by the clever handling of his pieces, sees the game taking the course intended.
zh_cn: 她感觉像是一个棋手通过巧妙地操纵他的棋子看着棋局朝着预期的方向前进。

source: Her eyes were bright and tender with a smile as they glanced up into his; and her lips looked hungry for the kiss which they invited.
zh_cn: 她抬眼看向他的眼睛时，她的眼睛明亮温柔、洋溢着微笑；她的嘴唇看起来渴望得到它们所欢迎的吻。

source: "But, you know," he went on quietly, "I didn't tell him so, it would have seemed ungrateful, but I can tell you.
zh_cn: “但是，你知道，”他平静地继续说，“我没告诉他，这好像不领情，但我可以告诉你。

source: I've stopped kissing women; it's dangerous."
zh_cn: 我已经不再吻女人了；太危险了。”

source: Well, she had Brantain and his million left.
zh_cn: 好吧，她还剩下布兰泰恩和他的百万财富。

source: A person can't have everything in this world; and it was a little unreasonable of her to expect it.
zh_cn: 一个人不可能拥有这世界上的一切；她期望得到所有也有点不合理。
